; domain
(define (domain healthcare)

(:requirements :strips :typing :negative-preconditions :quantified-preconditions)

(:types
	location
	unit
	robot-box - robot
	robot-escort - robot
	content
	box
	patient
)

(:constants 
	central_warehouse - location
	entrance - location
	scalpel tongue_depressor aspirin bandage thermometer - content
)

(:predicates
	(unit-at ?u - unit ?l - location)       ; unit is at location
	(box-at ?b - box ?l - location)         ; box is at location
	(robot-at ?r - robot ?l - location) ; robot is at location
	(content-at ?c - content ?l - location) ; content is at location
	(patient-at ?p - patient ?l - location) ; patient is at location
	(patient-at-unit ?p - patient ?u - unit) ; patient is at unit

	(filled-with ?b - box ?c - content) 		; box is filled with content 
	(empty-box ?b - box)               			; box is empty
	
	(unit-has-content ?u - unit ?c - content) ; unit has specific content
	(unit-has-box ?u - unit ?b - box)              ; unit has a box
	
	(loaded ?r - robot-box ?b - box)          ; robot is carrying a box
	(unloaded ?r - robot-box)               	; robot is empty

	(with-patient ?r - robot-escort)     ; robot is with a patient

	(connected ?l1 - location ?l2 - location) ; locations are connected
)


; (:functions)

;define actions here
(:action fill
	:parameters (?r - robot-box ?b - box ?c - content ?l - location)
	:precondition (and 
		(box-at ?b ?l)
		(robot-at ?r ?l)
		(content-at ?c ?l)
		(empty-box ?b)
	)
	:effect (and 
		(filled-with ?b ?c)
		(not (empty-box ?b))
	)
)

(:action empty
	:parameters (?r - robot-box ?b - box ?c - content ?u - unit ?l - location)
	:precondition (and 
		(unit-at ?u ?l)
		(box-at ?b ?l)
		(robot-at ?r ?l)
		(unit-has-box ?u ?b)
		(filled-with ?b ?c)
		(not (empty-box ?b))
		(not (unit-has-content ?u ?c))
	)
	:effect (and 
		(unit-has-content ?u ?c)
		(not (filled-with ?b ?c))
		(empty-box ?b)
		(content-at ?c ?l)
	)
)

(:action pick-up
	:parameters (?r - robot-box ?b - box ?l - location)
	:precondition (and 
		(box-at ?b ?l)
		(robot-at ?r ?l)
		(unloaded ?r)
	)
	:effect (and 
		(loaded ?r ?b)
		(not (unloaded ?r))
		(not (box-at ?b ?l))
	)
)

; (:action move
; 	:parameters (?r - robot-box ?from - location ?to - location)
; 	:precondition (and 
; 		(robot-at ?r ?from)
; 		(or (connected ?from ?to) (connected ?to ?from))
; 	)
; 	:effect (and 
; 		(robot-at ?r ?to)
; 		(not (robot-at ?r ?from))
; 		(forall (?b - box) 
; 			(when (loaded ?r ?b) 
; 				(and (box-at ?b ?to)
; 					(not (box-at ?b ?from))
; 				)
; 			)
; 		)
; 	)
; )

(:action move-unloaded
  :parameters (?r - robot ?from - location ?to - location)
  :precondition (and 
    (robot-at ?r ?from)
    (or (unloaded ?r) (not (with-patient ?r)))
    (or (connected ?from ?to) (connected ?to ?from))
  )
  :effect (and 
    (robot-at ?r ?to)
    (not (robot-at ?r ?from))
  )
)

(:action move-loaded
  :parameters (?r - robot-box ?b - box ?from - location ?to - location)
  :precondition (and 
    (robot-at ?r ?from)
    (loaded ?r ?b)
    (or (connected ?from ?to) (connected ?to ?from))
  )
  :effect (and 
    (robot-at ?r ?to)
    (not (robot-at ?r ?from))
    (box-at ?b ?to)
    (not (box-at ?b ?from))
  )
)


(:action deliver
		:parameters (?r - robot-box ?b - box ?l - location ?u - unit)
		:precondition (and
			(robot-at ?r ?l)
			(unit-at ?u ?l)
			(box-at ?b ?l)

			(loaded ?r ?b)
		)
		:effect (and 
			(unit-has-box ?u ?b)
			(not (loaded ?r ?b))
			(unloaded ?r)
		)
)

(:action take-patient
	:parameters (?r - robot-escort ?p - patient ?l - location)
	:precondition (and 
		(robot-at ?r ?l)
		(patient-at ?p ?l)
		(not (with-patient ?r))
	)
	:effect (and 
		(with-patient ?r)
	)
)

(:action move-with-patient
	:parameters (?r - robot-escort ?p - patient ?from - location ?to - location)
	:precondition (and 
		(robot-at ?r ?from)
		(patient-at ?p ?from)
		(with-patient ?r)
		(or (connected ?from ?to) (connected ?to ?from))
	)
	:effect (and 
		(robot-at ?r ?to)
		(patient-at ?p ?to)
		(not (robot-at ?r ?from))
		(not (patient-at ?p ?from))
	)
)

(:action release-patient
	:parameters (?r - robot-escort ?p - patient ?l - location ?u - unit)
	:precondition (and 
		(robot-at ?r ?l)
		(patient-at ?p ?l)
		(unit-at ?u ?l)
		(with-patient ?r)
	)
	:effect (and 
		(not (with-patient ?r))
		(patient-at ?p ?l)
		(patient-at-unit ?p ?u)
	)
)
)

; problem
(define (problem problem1) (:domain healthcare)
(:objects 
    r1 - robot-box
    r2 - robot-escort
    
    b1 b2 b3 - box

    u1 u2 u3 - unit
    l1 l2 l3 - location

    p1 p2 - patient
    ;central_warehouse entrance - location
    ;scalpel tongue_depressor aspirin bandage thermometer - content
)

(:init
    (box-at b1 central_warehouse)
    (box-at b2 central_warehouse)
    (box-at b3 central_warehouse)

    (empty-box b1)
    (empty-box b2)
    (empty-box b3)

    (content-at scalpel central_warehouse)
    (content-at tongue_depressor central_warehouse)
    (content-at aspirin central_warehouse)
    (content-at bandage central_warehouse)
    (content-at thermometer central_warehouse)

    (unit-at u1 l1)
    (unit-at u2 l2)
    (unit-at u3 l3)

    (robot-at r1 central_warehouse)
    (robot-at r2 entrance)

    (unloaded r1)

    (patient-at p1 entrance)
    (patient-at p2 entrance)
    
    (connected central_warehouse entrance)
    (connected entrance l1)
    (connected entrance l2)
    (connected entrance l3)
    (connected central_warehouse l1)
    (connected central_warehouse l2)
    (connected central_warehouse l3)
)

(:goal (and
    ;todo: put the goal condition here
    (unit-has-content u1 scalpel)
    (unit-has-content u1 bandage)
    (unit-has-content u2 thermometer)

    ; (patient-at p1 l1)
    ; (patient-at p2 l2)

    (patient-at-unit p1 u1)
    (patient-at-unit p2 u2)
))

;un-comment the following line if metric is needed
;(:metric minimize (???))
)

; plan
1. (take-patient r2 p1 entrance)
   added: (with-patient r2)
   goals met: 0 of 5
2. (move-with-patient r2 p1 entrance l1)
   deleted: (robot-at r2 entrance) (patient-at p1 entrance)
   added: (robot-at r2 l1) (patient-at p1 l1)
   goals met: 0 of 5
3. (release-patient r2 p1 l1 u1)
   deleted: (with-patient r2)
   added: (patient-at-unit p1 u1)
   goals met: 1 of 5
4. (move-unloaded r2 l1 entrance)
   deleted: (robot-at r2 l1)
   added: (robot-at r2 entrance)
   goals met: 1 of 5
5. (take-patient r2 p2 entrance)
   added: (with-patient r2)
   goals met: 1 of 5
6. (move-with-patient r2 p2 entrance l2)
   deleted: (robot-at r2 entrance) (patient-at p2 entrance)
   added: (robot-at r2 l2) (patient-at p2 l2)
   goals met: 1 of 5
7. (release-patient r2 p2 l2 u2)
   deleted: (with-patient r2)
   added: (patient-at-unit p2 u2)
   goals met: 2 of 5
8. (pick-up r1 b1 central_warehouse)
   deleted: (unloaded r1) (box-at b1 central_warehouse)
   added: (loaded r1 b1)
   goals met: 2 of 5
9. (move-loaded r1 b1 central_warehouse l1)
   deleted: (robot-at r1 central_warehouse)
   added: (robot-at r1 l1) (box-at b1 l1)
   goals met: 2 of 5
10. (move-loaded r1 b1 l1 central_warehouse)
   deleted: (robot-at r1 l1) (box-at b1 l1)
   added: (robot-at r1 central_warehouse) (box-at b1 central_warehouse)
   goals met: 2 of 5
11. (fill r1 b1 bandage central_warehouse)
   deleted: (empty-box b1)
   added: (filled-with b1 bandage)
   goals met: 2 of 5
12. (move-loaded r1 b1 central_warehouse l1)
   deleted: (robot-at r1 central_warehouse) (box-at b1 central_warehouse)
   added: (robot-at r1 l1) (box-at b1 l1)
   goals met: 2 of 5
13. (deliver r1 b1 l1 u1)
   deleted: (loaded r1 b1)
   added: (unit-has-box u1 b1) (unloaded r1)
   goals met: 2 of 5
14. (empty r1 b1 bandage u1 l1)
   deleted: (filled-with b1 bandage)
   added: (unit-has-content u1 bandage) (empty-box b1) (content-at bandage l1)
   goals met: 3 of 5
15. (pick-up r1 b1 l1)
   deleted: (unloaded r1) (box-at b1 l1)
   added: (loaded r1 b1)
   goals met: 3 of 5
16. (move-loaded r1 b1 l1 central_warehouse)
   deleted: (robot-at r1 l1)
   added: (robot-at r1 central_warehouse) (box-at b1 central_warehouse)
   goals met: 3 of 5
17. (fill r1 b1 scalpel central_warehouse)
   deleted: (empty-box b1)
   added: (filled-with b1 scalpel)
   goals met: 3 of 5
18. (move-loaded r1 b1 central_warehouse l1)
   deleted: (robot-at r1 central_warehouse) (box-at b1 central_warehouse)
   added: (robot-at r1 l1) (box-at b1 l1)
   goals met: 3 of 5
19. (empty r1 b1 scalpel u1 l1)
   deleted: (filled-with b1 scalpel)
   added: (unit-has-content u1 scalpel) (empty-box b1) (content-at scalpel l1)
   goals met: 4 of 5
20. (move-loaded r1 b1 l1 central_warehouse)
   deleted: (robot-at r1 l1) (box-at b1 l1)
   added: (robot-at r1 central_warehouse) (box-at b1 central_warehouse)
   goals met: 4 of 5
21. (fill r1 b1 thermometer central_warehouse)
   deleted: (empty-box b1)
   added: (filled-with b1 thermometer)
   goals met: 4 of 5
22. (move-loaded r1 b1 central_warehouse l2)
   deleted: (robot-at r1 central_warehouse) (box-at b1 central_warehouse)
   added: (robot-at r1 l2) (box-at b1 l2)
   goals met: 4 of 5
23. (deliver r1 b1 l2 u2)
   deleted: (loaded r1 b1)
   added: (unit-has-box u2 b1) (unloaded r1)
   goals met: 4 of 5
24. (empty r1 b1 thermometer u2 l2)
   deleted: (filled-with b1 thermometer)
   added: (unit-has-content u2 thermometer) (empty-box b1) (content-at thermometer l2)
   goals met: 5 of 5
